'''Найти и вывести на экран квадраты и кубы чисел от 2 до 5.'''

print('Квадраты чисел от 2 до 5:')

for i in range(2, 6):
    i **= 2
    print(i)

print('Кубы чисел от 2 до 5:')

for i in range(2, 6):
    i **= 3
    print(i)
